In [6]:
import pandas as pd
var =pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
var.insert(1,"python",[11,12,13,14,15])
var

   A  python  B
0  1      11  9
1  2      12  8
2  3      13  7
3  4      14  6
4  5      15  5

In [7]:
var.insert(1,"python_1",var["A"])
var

   A  python_1  python  B
0  1         1      11  9
1  2         2      12  8
2  3         3      13  7
3  4         4      14  6
4  5         5      15  5

In [14]:
import pandas as pd
var =pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[34,45,67,56,54]})
var

   A  B   C
0  1  9  34
1  2  8  45
2  3  7  67
3  4  6  56
4  5  5  54

In [15]:
var1=var.pop("B")
var1

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

Delete

In [17]:
 
var

   A   C
0  1  34
1  2  45
2  3  67
3  4  56
4  5  54

In [ ]:
del var["A"]
var